*** DONE pull request to the porn site list project                      :pr:
fix the columndeeply/hosts 's 127.0.0.0 to 0.0.0.0

by clone and compare the problem is that "I include a lost non-porn site in to it".
not just "non-porn" sites, I also get a lot cdn server to block, which fetch from a lot of m3u8 streaming server. it may also block some movies which using the same server as porn sites...
so, there is only KLUDGE for thing like blocking porn site, first question: what is porn? really?
to be, the social media like twitter which spread sexual clip? the pornhub teaching mathmatic? the reddit/4chan/zhihu/weibo/... even the taobao can sell sex toys with sexual pictures, so blocking internet is blocking porn really? I don't know, it's a question for everyone.

finished, by

#+begin_src sh
  #!/usr/bin/env bash
set -euo pipefail

HOST_URLS=(
  "https://raw.githubusercontent.com/columndeeply/hosts/main/hosts00"
  "https://raw.githubusercontent.com/columndeeply/hosts/main/hosts01"
  "https://raw.githubusercontent.com/columndeeply/hosts/main/hosts02"
  "https://raw.githubusercontent.com/columndeeply/hosts/main/hosts03"
  "https://raw.githubusercontent.com/columndeeply/hosts/main/hosts04"
  "https://raw.githubusercontent.com/columndeeply/hosts/main/hosts05"
)

TMPDIR="$(mktemp -d)"
REMOTE_DOMAINS="$TMPDIR/remote_domains"
YOUR_DOMAINS="$TMPDIR/your_domains"
OUTPUT="hosts6"

echo "[*] Downloading hostlists..."
> "$REMOTE_DOMAINS"
for url in "${HOST_URLS[@]}"; do
    echo "    -> $url"
    curl -sL "$url" \
        | grep -E "^[0-9:\.]+" \
        | awk '{print $2}' \
        >> "$REMOTE_DOMAINS"
done

echo "[*] Normalizing remote domains..."
sort -u "$REMOTE_DOMAINS" > "$TMPDIR/remote_sorted"

echo "[*] Extracting your domains..."
grep -E "^[0-9:\.]+" /etc/hosts \
    | awk '{print $2}' \
    | sort -u \
    > "$YOUR_DOMAINS"

echo "[*] Generating unique domains (hosts6)..."
comm -23 "$YOUR_DOMAINS" "$TMPDIR/remote_sorted" \
    | awk '{print "0.0.0.0", $1}' \
    > "$OUTPUT"

echo "[+] Done. Unique domains saved in $OUTPUT"
echo "    Total: $(wc -l < "$OUTPUT")"

#+end_src

#+RESULTS:
| [*] | Downloading                                                       | hostlists... |
| -> | https://raw.githubusercontent.com/columndeeply/hosts/main/hosts00 |            |

get uniq hosts, and update to github. it's I only get 23240 unique lines.

add 17868 new hosts

Used to maintain my hostslist, write a tempermonkey script with ublacklist addon to block chinese keyword search result automatically.

mainly it blocked sexual model gallary sites/Pirate JAV/and chinese porn m3u8 CDN which I filter from a github m3u8 collection repos/or anything non-programming like socialmedia/news/shopping..., occationally the script blocks org/edu/gov sites too.

I remove duplicate hosts in yours and delete non-porn sites, but there still too many which I can't checkout they all.

BTW, I didn't update my hostslist for a long time, because I just find blocking search engine and "hot" social-media instead porn sites is way more easier, I now use tavily/chatgpt/github in emacs only.

BTW, seems like use 0.0.0.0 instaed of 127.0.0.1 is faster.

